#КОРТЕЖИ

tuple1 = (1, 2, 3, "apple", "banana", 2)
print(tuple1)                   # Вывод кортежа
print(tuple1[len(tuple1) - 1])  # Вывод по индексу - самый последний
print(tuple1[1:3])              # Вывод срезом
print(tuple1.count(2))          # Выводит количество вхождений числа 2
print(tuple1.index(2))          # Выводит индекс первого вхождения

# Использование кортежа в качестве ключа словаря
my_dict = {(1, 2): "value"}
print(my_dict)

# Распаковка кортежа
a, b, c = (4, 5, 6)
print(a, b, c)  # Выводит 4 5 6

# ЛИСТ КОРТЕЖЕЙ

listOfTuples = [
    ("Вася Пупкин", 2500),
    ("Чел Петрович", 1000),
    ("Сильвестер Сталоне", 100),
    ("Сонечка", 9999999)
    ]

for name, amount in listOfTuples:
    print("{1} рублей должен(на) мне {0}".format(name, amount))
